[
  {
    "id": 1,
    "title": "From Arc Reactor to Startups: Lessons from Iron Man",
    "date": "18 Sep 2025",
    "author": "Prakarsh",
    "excerpt": "What Tony Stark’s journey teaches us about the grit, chaos, and innovation of real-world entrepreneurship.",
    "content": "<p>Entrepreneurship isn’t about boardrooms or well-ironed suits, it’s about chaos, survival, and invention in the dark. Think about Tony Stark in that Afghan cave, hammering out the Mark I with nothing but scraps and grit. That moment is the essence of every founder’s journey: you don’t start with perfect tools, you start with desperation and a dream. Real startups are born not in polished incubators but in basements, dorm rooms, and coffee-stained notebooks.</p><p>Stark’s life reminds us that the greatest companies don’t emerge from comfort; they emerge from crisis. His arc reactor wasn’t a luxury project, it was survival. Every founder who has run out of funds, faced rejection from investors, or watched competitors outpace them knows this pressure. It’s in the chaos that innovation finds its sharpest edge. As Reid Hoffman once said, “An entrepreneur is someone who jumps off a cliff and builds a plane on the way down.” Stark literally did that only his plane was made of iron.</p><p>But Tony wasn’t perfect. His arrogance mirrors the entrepreneur’s curse believing you alone have all the answers. Yet his growth also mirrors the founder’s evolution: from individual genius to collaborative leader. Stark Industries became the Avengers of business not because of Stark alone, but because he learned to build a team. That’s the golden lesson: startups may be sparked by a single mind, but they scale through collective fire.</p><p>And let’s not forget failure. Tony failed constantly his suits broke down, villains exploited his flaws, governments mistrusted him. Yet every failure became iteration. Entrepreneurs need this mindset: failure is not the end, it’s R&D you didn’t have to pay consultants for. Each broken suit was Stark’s beta version, and each comeback was a pivot. That’s why entrepreneurs should tattoo this mindset on their brains: fail fast, learn faster.</p><p>Finally, legacy. Stark doesn’t just represent wealth or tech; he represents resilience. The greatest entrepreneurs Jobs, Musk, Edison all left behind legacies not of money, but of courage to build what others couldn’t imagine. Iron Man’s final act wasn’t about power, but about purpose. And isn’t that the real reason to build anything?</p><p>So here’s the truth: Entrepreneurship is Iron Man without the suit. Vulnerable, messy, human. But with enough courage, vision, and willingness to bleed for your idea you too can build your arc reactor and light up the world.</p>"
  },
  {
    "id": 2,
    "title": "The West’s Philosophy vs. Marvel’s Universe: A Dance of Contradictions",
    "date": "19 Sep 2025",
    "author": "Prakarsh",
    "excerpt": "Western philosophy seeks order and absolutes. Marvel thrives on contradictions. What happens when they collide?",
    "content": "<p>The Western philosophical tradition has long been obsessed with order, reason, and universal principles. Plato dreamt of the ideal form, Aristotle grounded it in logic, and Kant demanded moral duties that must never bend. Yet step into the Marvel universe, and you’ll find this entire edifice being cracked open by contradictions that make it… almost poetic.</p><p>Take Captain America, the embodiment of Kantian duty. His “I can do this all day” echoes like a categorical imperative unwavering, moral, absolute. Yet the universe he inhabits mocks absolutes. Tony Stark thrives not on duty but on pragmatism, bending rules, innovating in chaos, a Nietzschean figure sculpting values on his own terms. West’s philosophy demands order; Marvel thrives in disorder. The contradiction is not an error it’s the essence of the narrative.</p><p>Consider utilitarianism Bentham’s calculus of maximizing happiness. Thanos, ironically, becomes its dark prophet. His infamous “snap” is not born from cruelty but from a utilitarian equation: sacrifice half to save the whole. The West preaches this cold logic in lecture halls, yet in Marvel it turns villainous, reminding us that when philosophy forgets humanity, it becomes tyranny.</p><p>Even existentialism, Sartre’s cry that “existence precedes essence,” finds its avatar in characters like Deadpool and Loki who refuse roles, refuse categories, and create identities in rebellion. Marvel mocks the West’s obsession with neat boxes. It suggests life is messier, funnier, bloodier and therefore truer.</p><p>And let’s not forget Hegel. His dialectic thesis, antithesis, synthesis plays out in Marvel arcs constantly. Heroes and villains are not simply good and evil; they are contradictions that force transformation. Think Wanda Maximoff: hero, villain, grieving mother, chaos incarnate. In her, the dialectic burns bright.</p><p>So what do we learn? That the West’s philosophy, when tested in a chaotic comic-book multiverse, collapses under its own weight. But in that collapse, something new is born: a philosophy that doesn’t demand perfection, but celebrates contradictions. After all, as Tony Stark said: “Sometimes you gotta run before you can walk.” Isn’t that the real philosophy? Imperfect, raw, alive.</p>"
  },
  {
    "id": 3,
    "title": "Why Queen Rhaenyra Outshines Aegon: Power, Legitimacy, and Philosophy",
    "date": "20 Sep 2025",
    "author": "Prakarsh",
    "excerpt": "Rhaenyra’s claim was more than bloodline; it was philosophy in action. Here’s why she towers over Aegon.",
    "content": "<p>When George R.R. Martin painted the bloody canvas of Targaryen politics, he didn’t just tell a story of dragons. He told us about power, legitimacy, and the philosophy of rulers. And when comparing Rhaenyra and Aegon, the scales tip heavily toward the Queen who should have been.</p><p>Think of Machiavelli’s The Prince. He argued it is better for a ruler to be feared than loved but most importantly, they must command legitimacy. Rhaenyra, trained from childhood as heir, embodies that legitimacy. Her claim is not a whim but an institution. Aegon, by contrast, is thrust into the throne like a pawn of ambition. He may wear the crown, but he does not own it. In philosophical terms: Rhaenyra is essence; Aegon is accident.</p><p>Aristotle’s idea of virtue ethics is also at play. A virtuous ruler must cultivate habits of wisdom, courage, and justice. Rhaenyra, through resilience and political acumen, edges closer to that ideal. Aegon? His life of vice, indulgence, and cowardice makes him the very opposite of the Aristotelian phronimos (the wise one).</p><p>Even modern philosophy has a word here. Simone de Beauvoir, in The Second Sex, critiques how women are often denied full humanity, treated as “the Other.” Rhaenyra’s struggle is not just against Aegon but against a patriarchal system that cannot accept a woman as sovereign. Her fight is, in a sense, existential: a demand to be recognized not as “daughter” or “wife,” but as Queen.</p><p>Aegon’s reign reflects brute force propped up by fear. Rhaenyra’s, despite tragedy, represents legitimacy, continuity, and vision. If history is philosophy in action, then the contradiction is clear: power without legitimacy corrodes, but legitimacy tempered by resilience endures.</p><p>As Marcus Aurelius wrote, “The best revenge is not to be like your enemy.” Rhaenyra, despite being denied her crown, remains remembered as the rightful queenm while Aegon fades into the dustbin of usurpers. That’s philosophy written in dragonfire.</p>"
  }
]
